feat: decabill documentation and provisioning (#440)
